<?php
	// http://myshop/?page=about
	if (isset($_GET['page'])) {
		$page = $_GET['page'];
	} else {
		$page = '';
	}

	$path = './templates/';


//Главная страница
//============================================================================
	if ($page == '') {
		include($path . 'content/main_content.php');
		$content = $main_content;






//Страница О магазине...
//============================================================================
	} elseif ($page == 'about') {
		$content = '<h3>About page</h3>';





//Страница Акции
//============================================================================
	} elseif ($page == 'act_page') {
		$content = '<h3>Action page</h3>';









//Страница Корзина
//============================================================================
	} elseif ($page == 'cart') {
		$content = '<h3>Cart page</h3>';




//404
//=============================================================================
	} else {
		$content = '<h3>404 page</h3>';


	}

?>